In [31]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [32]:
data = np.arange(8)

In [33]:
data

array([0, 1, 2, 3, 4, 5, 6, 7])

In [34]:
index = ['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8']

In [35]:
index

['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6', 'row 7', 'row 8']

In [36]:
series_obj = Series(data,index)

In [37]:
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [38]:
series_obj['row 7']

6

In [39]:
series_obj[7]

7

In [40]:
series_obj[[0,7]]

row 1    0
row 8    7
dtype: int64

In [41]:
df = DataFrame(np.random.rand(36).reshape((6,6)), 
              index = ['row 1','row 2','row 3','row 4','row 5','row 6'],
              columns = ['column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'])

In [42]:
df

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.831503  0.721575  0.286287  0.061250  0.491096  0.522628
row 2  0.328455  0.033921  0.302920  0.973423  0.974835  0.228971
row 3  0.910765  0.642701  0.580437  0.345583  0.970932  0.803273
row 4  0.132056  0.309782  0.382478  0.464469  0.878579  0.412851
row 5  0.026125  0.249928  0.196615  0.857043  0.424376  0.928653
row 6  0.132479  0.197942  0.938795  0.431373  0.838515  0.082027

In [43]:
df.loc[['row 1', 'row 2'], ['column 1', 'column 2']]

       column 1  column 2
row 1  0.831503  0.721575
row 2  0.328455  0.033921

In [44]:
series_obj['row 3': 'row 6']

row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [45]:
series_obj['row 3': 'row 6' : -1]

Series([], dtype: int64)

In [46]:
series_obj['row 3'::]

row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [47]:
series_obj[: 'row 6':]

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [48]:
df['row 1': 'row 5']

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.831503  0.721575  0.286287  0.061250  0.491096  0.522628
row 2  0.328455  0.033921  0.302920  0.973423  0.974835  0.228971
row 3  0.910765  0.642701  0.580437  0.345583  0.970932  0.803273
row 4  0.132056  0.309782  0.382478  0.464469  0.878579  0.412851
row 5  0.026125  0.249928  0.196615  0.857043  0.424376  0.928653

In [49]:
df.loc[['row 1', 'row 5'],['column 2','column 5']]

       column 2  column 5
row 1  0.721575  0.491096
row 5  0.249928  0.424376

In [50]:
#Checking if individual values in the DF is greaer than 0.5

In [51]:
df>0.5

       column 1  column 2  column 3  column 4  column 5  column 6
row 1      True      True     False     False     False      True
row 2     False     False     False      True      True     False
row 3      True      True      True     False      True      True
row 4     False     False     False     False      True     False
row 5     False     False     False      True     False      True
row 6     False     False      True     False      True     False

In [52]:
series_obj[series_obj > 5]

row 7    6
row 8    7
dtype: int64

In [53]:
df_gt5 = df[df > 0.5] #Need to check how the NaN can be set to 0 in a single statement

In [54]:
df_gt5

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.831503  0.721575       NaN       NaN       NaN  0.522628
row 2       NaN       NaN       NaN  0.973423  0.974835       NaN
row 3  0.910765  0.642701  0.580437       NaN  0.970932  0.803273
row 4       NaN       NaN       NaN       NaN  0.878579       NaN
row 5       NaN       NaN       NaN  0.857043       NaN  0.928653
row 6       NaN       NaN  0.938795       NaN  0.838515       NaN

In [55]:
df_gt5.isnull()

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False      True      True      True     False
row 2      True      True      True     False     False      True
row 3     False     False     False      True     False     False
row 4      True      True      True      True     False      True
row 5      True      True      True     False      True     False
row 6      True      True     False      True     False      True

In [56]:
filled_df = df_gt5.fillna(0)
# fillna({0:0.1, 5:1.25}) 
# for filling all Nan values in 
#      0th index with 0.1 
#      5th index with 1.25

In [57]:
filled_df

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.831503  0.721575  0.000000  0.000000  0.000000  0.522628
row 2  0.000000  0.000000  0.000000  0.973423  0.974835  0.000000
row 3  0.910765  0.642701  0.580437  0.000000  0.970932  0.803273
row 4  0.000000  0.000000  0.000000  0.000000  0.878579  0.000000
row 5  0.000000  0.000000  0.000000  0.857043  0.000000  0.928653
row 6  0.000000  0.000000  0.938795  0.000000  0.838515  0.000000

In [58]:
df2 = DataFrame(np.arange(36).reshape(6,6))

In [59]:
df2

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [60]:
df3 = DataFrame(np.random.rand(36).reshape((6,6)), 
              index = ['row 1','row 2','row 3','row 4','row 5','row 6'],
              columns = ['column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'])

In [61]:
df3

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.777583  0.671175  0.712323  0.504266  0.767074  0.629904
row 2  0.793369  0.197271  0.042509  0.477144  0.767835  0.704827
row 3  0.733730  0.291238  0.746222  0.767926  0.975616  0.078193
row 4  0.224092  0.355626  0.560385  0.569242  0.954029  0.595489
row 5  0.886271  0.471001  0.356275  0.456081  0.352520  0.698009
row 6  0.193075  0.230261  0.153342  0.785266  0.190262  0.503430

In [62]:
#Concatenating dataframes

Df_obj1 = DataFrame(np.arange(36).reshape(6,6))
Df_obj2 = DataFrame(np.arange(15).reshape(5,3))

In [63]:
Df_obj1

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [64]:
Df_obj2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [65]:
pd.concat([Df_obj1, Df_obj2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [66]:
pd.concat([Df_obj1, Df_obj2])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

In [67]:
df3

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.777583  0.671175  0.712323  0.504266  0.767074  0.629904
row 2  0.793369  0.197271  0.042509  0.477144  0.767835  0.704827
row 3  0.733730  0.291238  0.746222  0.767926  0.975616  0.078193
row 4  0.224092  0.355626  0.560385  0.569242  0.954029  0.595489
row 5  0.886271  0.471001  0.356275  0.456081  0.352520  0.698009
row 6  0.193075  0.230261  0.153342  0.785266  0.190262  0.503430

In [71]:
df3.sort_values('column 5', ascending=[True])

       column 1  column 2  column 3  column 4  column 5  column 6
row 6  0.193075  0.230261  0.153342  0.785266  0.190262  0.503430
row 5  0.886271  0.471001  0.356275  0.456081  0.352520  0.698009
row 1  0.777583  0.671175  0.712323  0.504266  0.767074  0.629904
row 2  0.793369  0.197271  0.042509  0.477144  0.767835  0.704827
row 4  0.224092  0.355626  0.560385  0.569242  0.954029  0.595489
row 3  0.733730  0.291238  0.746222  0.767926  0.975616  0.078193

In [74]:
#Grouping 

source = '/home/jyothish/Downloads/Ex_Files_Python_Data_Science_EssT_Pt_1/Exercise Files/Data/mtcars.csv'
df_cars = pd.read_csv(source)

In [75]:
df_cars

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
12,Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [76]:
df_cars_grouped = df_cars.groupby(df_cars['cyl'])
df_cars_grouped

In [77]:
df_cars_grouped.mean()

,mpg,disp,hp,drat,wt,qsec,vs,am,gear,carb
cyl,,,,,,,,,,
4,26.663636,105.136364,82.636364,4.070909,2.285727,19.137273,0.909091,0.727273,4.090909,1.545455
6,19.742857,183.314286,122.285714,3.585714,3.117143,17.977143,0.571429,0.428571,3.857143,3.428571
8,15.100000,353.100000,209.214286,3.229286,3.999214,16.772143,0.000000,0.142857,3.285714,3.500000